

const arr = [
    `मेरे जनाज़े पे जल्दी आना ये दोस्त; तब में इतना बुरा नही रहूंगा ।`,
    `शायद! वो ज़ख्म ज़ख्म ही रह जाता... इसके बहाने, पर कोई पूछने तो आता !`,
    `ये खुदा, किसको ठेस पहुंचाई हमने; हमे मरीज़ बना दीया यार !`,
    `आज ठंड बहुत है मुझे आपके दिल में समा लोना; कल आप ही कह रहे थे, दिल आग बबूला हो रहा है ।`,
    `आज रूठ गए हो, कल तो बुलाओ गे ना ? मेरे बिना रह पाओगे, क्या ?`,
    `क्या ? आप अभी भी मुझसे रूठे हुऐ हो ? जाओ, नहीं बात करनी तुमसे ।`,
    `मेरी चाहत है की में सभी लोगो को चाहूं; लेकिन यहां तो सब अपने काम में व्यस्त है !`,
    `हमें मत छेड़ा करो हम गुस्सा हो जायेंगे; बता रहा हूँ, बाद में जोभी होगा उसके जिम्मेदार आप होंगे |`,
    `आज-कल ये दोस्त भी बिगड़े हुए लगते है; साले, हम से भी रूठे हुए लगते है । `,
    `अब लोग हमसे परेशान हो रहे हैं; शायद उनका मकसद पूरा हो गया होगा |`,
    `हम किसीको हमसे दूर नहीं करना चाहते; लोग अपने आप हमसे दूर हो रहे है ।`,
    `उस दोस्त पर मत हसा करो; जिसने आपके दुःख पर रोना सीख लिया हो ।`,
    `हमारा बुलाना, आपको पसंद नही तो कह दीजिए; हमे हर बार आपसे उम्मीदें रहा करती है ।`,
    `हमसे कोई बात तक नहीं करना चाहता; हम इतने बुरे कब से हो गए ?`,
    `हमे सभी अपने ही लगते है; फिर भी न जाने लोग क्यूं हमसे दूर रहते हैं ।`,
    `हमे एक-एक करके सभी को याद करवाना पड़ेगा; वरना, लोग अक्सर हमे भूल जाते है की हम भी मित्र है ।`,
    `हमे ख़याल रखना ज्यादा अच्छा लगता है; शायद, लोग उसी का लाभ उठाते है !`,
    `लोग हम पर हंसा करते है; खैर अपने ही है ना !`,
    `आपका गुस्सा जायज है पर हमारा क्या कसूर ? हमारी गलती थी हमने आज याद कर लिया ।`,
    `हम जब याद करते है तब ही लोग व्यस्त हो जाते हैं; पता नही हम, परेशान कर रहे है या फिर आम लगते है?`,
    `दोस्ती निभाई नही जाती,मत रखा करो यार; हम कमज़ोर वो दिल है, बार बार मत तोड़ा करो यार !`

];

const lafz = document.querySelector('.lafz');
let i = 0;

lafz.textContent = arr[i];

function updateText() {
    lafz.textContent = arr[i];
}

document.querySelector('#next').addEventListener('click', function() {
    if (i < arr.length - 1) {
        i++;
        updateText();
    }
});

document.querySelector('#previous').addEventListener('click', function() {
    if (i > 0) {
        i--;
        updateText();
    }
});
